package com.company.day8;
/*
*1>super可以访问父类中定义的属性，可以调用父类中的成员方法
* super可疑在子类的构造方法中调用父类的构造方法
* 当子父类出现重名的成员，可以用super进行区分，super的追溯不仅限于直接父类
* 和this相似，super代表父类的内存空间的标识
* super: 可以用来修饰属性，方法，构造器
*
* 子类与父类中有同名的属性时。通过super.属性调用父类中声明的属性
* 调用子类同名的属性用this.属性
* 2）子类重写父类的方法之后，子类想显式调用父类中的方法，就得super.方法
*
* 3）super修饰构造器，通过在子类中使用super(形参列表)来显式调用父类 中指定的构造器
* super（形参列表）必须声明在首行，在构造器内部super（形参列表）或this（形参列表）只能出现一个
* 在构造器中不显式的调用super（形参列表）或this（形参列表）默认调用 父类中空参的构造器
* 设计一个类时，尽量要提供一个空参的构造器
* */
public class Testsuper {
}
