package com.company.day5;

public class mast {
/*  1.面向对象和面向过程：
    向对象强调有功能的对象
    面向过程强调功能。
    2.面向对象的变成关注于类的设计
    一个项目或工程，都是有多个类构成的
    3.完成一个项目或者功能的思路：
    1）所要完成的功能对应的类的对象是否存在
    2）若存在，通过对象直接调用对应的的类中的属性或方法
    3）不存在的话，需要设计类
    4.面向对象编程的三条主线
    1）类和类的构成成分：属性 方法 构造器 代码块 内部类
    2）面向对象编程的特征：封装性，继承性，多态性（抽象性）
    3）关键字：this super package import static final abstract interface
    3.1类的组成成分：
    1）属性（成员变量）
    2）方法（成员方法，函数）提供某种功能的实现
    3.1面向对象编程的思想的落地：
    1）设计并创建类及类的成分
    2）实例化类的对象
    4：类的初始化的内存解析
    4.1内存划分的结构：
    栈，堆，方法区，静态域


    */



}
